// Напишите программу, которая на вход принимает число и выдает его квадрат
// (число умноженное само на себя)
Console.Write("Введите число: ");
int number = int.Parse(Console.ReadLine());
int sqr = number * number;
Console.WriteLine($"Квадрат числа {number} равен = {sqr}");


Console.Write("Введите первое число: ");
int number = int.Parse(Console.ReadLine());
Console.Write("Введите второе число: ");
int number = int.Parse(Console.ReadLine());

if(number1 == number2*number2)
{
    Console.Write("Первое число является квадратом второго числа");
}
else
{
  Console.Write("Первое число не является квадратом второго числа");
}

