// Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
//645 -> 5
//  7 -> третьей цифры нет
// 32679 -> 6
Console.Write("Введите число: ");
int count = number.ToString().Length;
Console.Write(MakeArray(number, count));


